# coding: utf-8
# В первой строчки нужно указать кодировку фалй (для 2-ого python)
# комментарий
#--------------------------------------------------------------------------------------------

## Hello, World!
# 2 / 9 {операнд оператор операнд}
## возведение в степень 2**9 pow(2,9)
## """ многострочная строка """
#print("Hello!") # функция вывода
#--------------------------------------------------------------------------------------------

## Функции ввода/вывода
#x = input("Введите x: ") # функция ввода
#y = eva#( input("Введите y: ") ) # не безопасный метод. Пользователь может ввести что попало
#print( y )

#str = 'Hello'*2 #разможнение строк
#print( "Размножение строк\n", str )
#print( "Один символ тоже строка\n ", type('r') ) # <class 'str'>

#print(dir("hello")) # можно узнать набор методов этого объекта
#print(dir( 1 ))
#--------------------------------------------------------------------------------------------

## Переопределение зарезервированных имён
#str = "help" # str-строка
##str(13) # TypeError: 'str' object is not callable
#
#del str
#print(str(13))

#
#print( dir(__builtins__) ) # не п#ереопределяйте эти слова
#--------------------------------------------------------------------------------------------

## управляющие конструкции
#x = int(input('Enter x: '))
#
#if x ^ 6 == 8: # xor - бинарная операция. Возвращает 1, когда биты разные
#    print(x)   # Нужно ввести 14
#elif x ^ 7 == 7:
#    print('x =', x)
#else:
#    print(x ** 2)

## 0110 6
## 1000 8
## 1110 14
#--------------------------------------------------------------------------------------------

## философия python
#import this #import - подключает модуль
#--------------------------------------------------------------------------------------------

## Функция bool()
#print(bool("False")) # пусто или нет True

#print(bool(print()) # False
#print(bool("")) # False
#print(bool("0"))# False
#print(bool([])) # False

# str(True) # 'True'
#--------------------------------------------------------------------------------------------

## Циклы

#x = ""
#while x != "q":
#   x = input("#Enter string (q - to exit): ")

#x = int(input("Enter a number\n"))
#y = 2
#while y < x / 2:
#    if x % y == 0:
#        print('The {0} divided on the {1} '.format(x, y)) # format подставляется на места {} свои аргументы
#        break                                           # можно использовать {index}
#    else:
#        y += 1
#else:               # else от while в while не было ни единого break
#    print('The x is a simple number')
##--------------------------------------------------------------------------------------------
#
#  None
#type(None) # <class 'NoneType'>
#
#x = None # ничто
#while x != 'q':
#    x = input()